In [1]:
import pandas as pd
import numpy as np
from pydataset import data
import pandas_profiling

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns


# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

import env
import util
import acquire

### Classification: Acquire data

#### Goals

-Data you wish to use in analysis will be stored in a variety of sources. In this lesson, we will review importing data from a csv and via mySQL, and we will also learn how to import data from our local clipboard, a google sheets document, and from an MS Excel file. We will then select one source to use as we continue through the rest of this module.

#### Methods of Data Acquisition

-read_clipboard: When you have data copied to your clipboard, you can use pandas to read it into a data frame with pd.read_clipboard. This can be useful for quickly transferring data to/from a spreadsheet.

-read_excel: This function can be used to create a data frame based on the contents of an Excel spreadsheet.

-read_csv: Read from a local csv, or from a the cloud (Google Sheets or AWS S3).

-read_sql(sql_query, connection_url): Read data using a SQL query to a database. You must have the required drivers installed, and a specially formatted url string must be provided.

    # To talk to a mysql database:
    python -m pip install pymysql mysql-connector
    #the connection url string:
    mysql+pymysql://USER:PASSWORD@HOST/DATABASE_NAME

1. Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

    -print the first 3 rows

    -print the number of rows and columns (shape)

    -print the column names

    -print the data type of each column

    -print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
df_iris = data("iris")

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [5]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
Sepal.Length    150 non-null float64
Sepal.Width     150 non-null float64
Petal.Length    150 non-null float64
Petal.Width     150 non-null float64
Species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [6]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [7]:
df_excel = pd.read_excel("my_telco_churn.xlsx", sheet_name="Table1_CustDetails")

     -assign the first 100 rows to a new dataframe, df_excel_sample

In [8]:
df_excel_sample = df_excel.head(100)

    -print the number of rows of your original dataframe

In [9]:
df_excel.shape[0]

7049

    -print the first 5 column names

In [10]:
list(df_excel.columns)[:5]

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

    -print the column names that have a data type of object

In [11]:
# transform non-numerical data into objects
df_excel = df_excel.astype({"is_senior_citizen": "object", "phone_service": "object", "internet_service": "object", "contract_type": "object"})

df_excel.dtypes

customer_id           object
gender                object
is_senior_citizen     object
partner               object
dependents            object
phone_service         object
internet_service      object
contract_type         object
payment_type          object
monthly_charges      float64
total_charges        float64
tenure               float64
churn                 object
Unnamed: 13          float64
phone_service.1       object
(Multiple Items)      object
dtype: object

In [12]:
#df_cust.dtypes[df_cust.dtypes == "object"]
df_excel_obj = df_excel.select_dtypes("object")
df_excel_obj.head().columns

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents',
       'phone_service', 'internet_service', 'contract_type', 'payment_type',
       'churn', 'phone_service.1', '(Multiple Items)'],
      dtype='object')

    -compute the range for each of the numeric variables.

In [13]:
#df_cust.dtypes[df_cust.dtypes != "object"]
df_excel_num = df_excel.select_dtypes(["int64", "float64"])
df_excel_num.max() - df_excel_num.min()

monthly_charges     100.500000
total_charges      8666.000000
tenure               79.341772
Unnamed: 13                NaN
dtype: float64

3. Read the data from this google sheet into a dataframe, df_google

    -print the first 3 rows

    -print the number of rows and columns

    -print the column names

    -print the data type of each column

    -print the summary statistics for each of the numeric variables

    -print the unique values for each of your categorical variables

#### Testing new funcs

In [14]:
sheet_url = "https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357"

csv_export_url = sheet_url.replace("/edit#gid=", '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
df_google.shape

(891, 12)

In [16]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [18]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [19]:
df_google.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C

In [20]:
# Transform data
df_google = df_google.astype({"Name": "category", "Survived": "category", "Pclass": "category", "Sex": "category", "Cabin": "category", "Ticket": "category", "Embarked": "category"})
df_google.dtypes

PassengerId       int64
Survived       category
Pclass         category
Name           category
Sex            category
Age             float64
SibSp             int64
Parch             int64
Ticket         category
Fare            float64
Cabin          category
Embarked       category
dtype: object

In [21]:
df_google.Survived.unique()

[0, 1]
Categories (2, int64): [0, 1]

In [22]:
df_google.Pclass.unique()

[3, 1, 2]
Categories (3, int64): [3, 1, 2]

In [23]:
df_google.Name.unique()

[Braund, Mr. Owen Harris, Cumings, Mrs. John Bradley (Florence Briggs Thayer), Heikkinen, Miss. Laina, Futrelle, Mrs. Jacques Heath (Lily May Peel), Allen, Mr. William Henry, ..., Montvila, Rev. Juozas, Graham, Miss. Margaret Edith, Johnston, Miss. Catherine Helen "Carrie", Behr, Mr. Karl Howell, Dooley, Mr. Patrick]
Length: 891
Categories (891, object): [Braund, Mr. Owen Harris, Cumings, Mrs. John Bradley (Florence Briggs Thayer), Heikkinen, Miss. Laina, Futrelle, Mrs. Jacques Heath (Lily May Peel), ..., Graham, Miss. Margaret Edith, Johnston, Miss. Catherine Helen "Carrie", Behr, Mr. Karl Howell, Dooley, Mr. Patrick]

In [24]:
df_google.Sex.unique()

[male, female]
Categories (2, object): [male, female]

In [25]:
df_google.Ticket.unique()

[A/5 21171, PC 17599, STON/O2. 3101282, 113803, 373450, ..., SOTON/OQ 392076, 211536, 112053, 111369, 370376]
Length: 681
Categories (681, object): [A/5 21171, PC 17599, STON/O2. 3101282, 113803, ..., 211536, 112053, 111369, 370376]

In [26]:
df_google.Cabin.unique()

[NaN, C85, C123, E46, G6, ..., E17, A24, C50, B42, C148]
Length: 148
Categories (147, object): [C85, C123, E46, G6, ..., A24, C50, B42, C148]

In [27]:
df_google.Embarked.unique()

[S, C, Q, NaN]
Categories (3, object): [S, C, Q]

In a new python module, acquire.py:

1. get_titanic_data: returns the titanic data from the codeup data science database as a pandas data frame.

2. get_iris_data: returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids.

In [28]:
titanic_df = acquire.get_titanic_data()

In [29]:
acquire.get_iris_data().head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

#### Prepare Data

    -drop columns
    
    -fillna
    
    -split
    
    -impute mean, mode, median: SimpleImputer
    
    -integer encoding: LabelEncoder
    
    -one hot encoding: OneHotEncoder
    
    -scale

In [30]:
#pandas_profiling.ProfileReport(titanic_df)

In [31]:
titanic_df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
passenger_id,891.0,445.000000,257.353842,0.00,222.5000,445.0000,667.5,890.0000
survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
sibsp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292
alone,891.0,0.602694,0.489615,0.00,0.0000,1.0000,1.0,1.0000

In [32]:
titanic_df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [33]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [34]:
titanic_df.age.value_counts(bins=10, sort=True)

(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.339, 8.378]       54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: age, dtype: int64

In [35]:
titanic_df.embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

In [36]:
# drop deck column bc it has so many NULL values it is worthless
titanic_df.drop(columns=["deck"], inplace=True)

In [37]:
# fill NAN into missing holes
titanic_df.fillna(np.nan, inplace=True)

In [38]:
train, test = train_test_split(titanic_df, train_size=.8, random_state=123)

In [39]:
# impute most_frequent in embark NANs
# create imputer -> fit train -> transform train and test
imp_mode = SimpleImputer(missing_values=np.nan, strategy="most_frequent")
imp_mode.fit(train[["embarked"]])
train["embarked"] = imp_mode.transform(train[["embarked"]])
test["embarked"] = imp_mode.transform(test[["embarked"]])

In [40]:
# Encoding -> Integer Encoding   (no missing values for this to work)
# change alpha to integer representing alpha

int_encoder = LabelEncoder()
int_encoder.fit(train.embarked)
train.embarked = int_encoder.transform(train.embarked)

In [41]:
train.embarked.value_counts()
test.embarked.value_counts()

S    129
C     40
Q     10
Name: embarked, dtype: int64

In [42]:
# Encoding -> One Hot Encoding
embarked_array = np.array(train.embarked)
embarked_array[0:5]

array([0, 1, 0, 1, 0])

In [43]:
# ohe needs a 2 dimensional array
embarked_array = embarked_array.reshape(len(embarked_array), 1)

In [44]:
ohe = OneHotEncoder(sparse=False, categories="auto")

In [45]:
embarked_ohe = ohe.fit_transform(embarked_array)
embarked_ohe

array([[1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       ...,
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [46]:
test.embarked = int_encoder.transform(test.embarked)

In [47]:
embarked_array = np.array(test.embarked).reshape(len(test.embarked), 1)
embarked_test_ohe = ohe.transform(embarked_array)
embarked_test_ohe[0:5]

array([[0., 0., 1.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.]])

### Preparation Exercises

-The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

1. Iris Data

    -Use the function defined in acquire.py to load the iris data.

In [48]:
df = acquire.get_iris_data()
df.head(2)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa

    -Drop the species_id and measurement_id columns.

In [49]:
df.drop(columns=["species_id","measurement_id"], inplace=True)

In [50]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa

    -Rename the species_name column to just species.

In [51]:
df.rename(columns={"species_name": "species"}, inplace=True)
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

    -Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [52]:
# create encoder
encoder = LabelEncoder()

In [53]:
# fit df
encoder.fit(df.species)

LabelEncoder()

In [54]:
# transform df
encoder.transform(df.species)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

    -Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [55]:
def prep_iris(df):
    df.drop(columns=["species_id","measurement_id"], inplace=True)
    df.rename(columns={"species_name": "species"}, inplace=True)
    encoder = LabelEncoder()
    ncoder.fit(df.species)
    encoder.transform(df.species)
    return df

In [62]:
df = acquire.get_titanic_data()
df.head(2)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0

In [69]:
df.info()
df.head(20)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(4)
memory usage: 83.6+ KB

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1
5,5,0,3,male,NaN,0,0,8.4583,Q,Third,Queenstown,1
6,6,0,1,male,54.0,0,0,51.8625,S,First,Southampton,1
7,7,0,3,male,2.0,3,1,21.0750,S,Third,Southampton,0
8,8,1,3,female,27.0,0,2,11.1333,S,Third,Southampton,0
9,9,1,2,female,14.0,1,0,30.0708,C,Second,Cherbourg,0
10,10,1,3,female,4.0,1,1,16.7000,S,Third,Southampton,0
11,11,1,1,female,58.0,0,0,26.5500,S,First,Southampton,1
12,12,0,3,male,20.0,0,0,8.0500,S,Third,Southampton,1
13,13,0,3,male,39.0,1,5,31.2750,S,Third,Southampton,0
14,14,0,3,female,14.0,0,0,7.8542,S,Third,Southampton,1
15,15,1,2,female,55.0,0,0,16.0000,S,Second,Southampton,1
16,16,0,3,male,2.0,4,1,29.1250,Q,Third,Queenstown,0
17,17,1,2,male,NaN,0,0,13.0000,S,Second,Southampton,1
18,18,0,3,female,31.0,1,0,18.0000,S,Third,Southampton,0
19,19,1,3,female,NaN,0,0,7.2250,C,Third,Cherbourg,1

    -Remove the deck column.

In [64]:
df.drop(columns=["deck"], inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(4)
memory usage: 83.6+ KB

In [65]:
df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
embark_town       2
alone             0
dtype: int64

In [66]:
df.fillna(np.nan, inplace=True)

    -Handle the missing values in the embark_town and embarked columns.

In [74]:
# A tilda in front of a boolean mask gives you the opposite!!! Cool
df = df[~df.embarked.isnull()]

    -Use a label encoder to transform the embarked column.

In [75]:
encoder = LabelEncoder()

In [76]:
encoder.fit(df.embarked)

LabelEncoder()

In [77]:
df.embarked = encoder.transform(df.embarked)

    -Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [79]:
from sklearn.preprocessing import MinMaxScaler

In [83]:
scaler = MinMaxScaler()
scaler.fit(df[["age"]])
df.age = scaler.transform(df[["age"]])

In [84]:
#scaler = MinMaxScaler()
scaler.fit(df[["fare"]])
df.fare = scaler.transform(df[["fare"]])

In [85]:
def prep_titanic():
    df.fillna(np.nan, inplace=True)
    df = df[~df.embarked.isnull()]
    encoder = LabelEncoder()
    encoder.fit(df.embarked)
    df.embarked = encoder.transform(df.embarked)
    scaler = MinMaxScaler()
    scaler.fit(df[["age"]])
    df.age = scaler.transform(df[["age"]])
    scaler.fit(df[["fare"]])
    df.fare = scaler.transform(df[["fare"]])
    return df